Core/src/Enums/ВариантыОтображенияИтоговБанкИКасса/ВариантыОтображенияИтоговБанкИКасса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОтображенияИтоговБанкИКасса</name>
  <enumValues>
    <name>ВедомостьЗаДень</name>
  </enumValues>
  <enumValues>
    <name>ВедомостьЗаПериод</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПересчитанныеВВалюту</name>
  </enumValues>
  <enumValues>
    <name>НеОтображатьИтоги</name>
  </enumValues>
</mdclass:Enum>

Core/src/CommonForms/ФормаНастройкиИтоговБанкИКасса/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ВариантОтображенияИтогов = Параметры.ВариантОтображенияИтогов;
	ВалютаВедомости = Параметры.ВалютаВедомости;
	ВалютаОстатков = Параметры.ВалютаОстатков;
	
	НастроитьЭлементыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыНаСервере()
	
	Если ВариантОтображенияИтогов = Перечисления.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаПериод Тогда
		Элементы.ВалютаВедомости.Видимость = Истина;
		Элементы.ВалютаОстатков.Видимость = Ложь;
		Элементы.Декорация1.Высота = 1;
		Элементы.Декорация1.Видимость = Ложь;
		Элементы.Группа2.Высота = 3;
	ИначеЕсли ВариантОтображенияИтогов = Перечисления.ВариантыОтображенияИтоговБанкИКасса.ОстаткиПересчитанныеВВалюту Тогда
		Элементы.ВалютаВедомости.Видимость = Ложь;
		Элементы.ВалютаОстатков.Видимость = Истина;
		Элементы.Декорация1.Высота = 3;
		Элементы.Декорация1.Видимость = Истина;
		Элементы.Группа2.Высота = 0;
	Иначе
		Элементы.ВалютаВедомости.Видимость = Ложь;
		Элементы.ВалютаОстатков.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьПояснительнуюНадпись();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если ВалютаВедомости.Пустая() И ВариантОтображенияИтогов = ПредопределенноеЗначение("Перечисление.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаПериод") Тогда
		
		Сообщение = Новый СообщениеПользователю; 
		
		//Малышев 2024-07-05 ONESOFT-3315 - переводы
		//Сообщение.Текст = "Выберите валюту ведомости.";
		Сообщение.Текст = НСтр("ka='აირჩიეთ ამონაწერის ვალუტა.';ru='Выберите валюту ведомости.';en='Select the statement currency.'");
		
		Сообщение.Поле = "ВалютаВедомости";
		Сообщение.Сообщить();
		
		Возврат;
		
	ИначеЕсли ВалютаОстатков.Пустая() И ВариантОтображенияИтогов = ПредопределенноеЗначение("Перечисление.ВариантыОтображенияИтоговБанкИКасса.ОстаткиПересчитанныеВВалюту") Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		//Малышев 2024-07-05 ONESOFT-3315 - переводы
		//Сообщение.Текст = "Выберите валюту остатков.";
		Сообщение.Текст = НСтр("ka='აირჩიეთ თქვენი ბალანსის ვალუტა.';ru='Выберите валюту остатков.';en='Select the currency of your balances.'");
		
		Сообщение.Поле = "ВалютаОстатков";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрЗакрытия = Новый Структура("ВариантОтображенияИтогов, ВалютаВедомости, ВалютаОстатков", ВариантОтображенияИтогов, ВалютаВедомости, ВалютаОстатков);
	Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтображенияИтоговПриИзменении(Элемент)
	
	НастроитьЭлементыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПояснительнуюНадпись()
	
	ТекстНадписи = "";
	
	Если ВариантОтображенияИтогов = Перечисления.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаДень Тогда
		//ТекстНадписи = "Дата, р/счет и валюта определяются по текущему документу.";
		ТекстНадписи = НСтр("ka='თარიღი, ანგარიში და ვალუტა განისაზღვრება მიმდინარე დოკუმენტის საფუძველზე.';ru='Дата, р/счет и валюта определяются по текущему документу.';en='The date, account and currency are determined based on the current document.'")
		
	ИначеЕсли ВариантОтображенияИтогов = Перечисления.ВариантыОтображенияИтоговБанкИКасса.ВедомостьЗаПериод Тогда
		//ТекстНадписи = "Будет использоваться период журнала.";
		ТекстНадписи = НСтр("ka='გამოყენებული იქნება ჟურნალის პერიოდი.';ru='Будет использоваться период журнала.';en='The log period will be used.'")
	ИначеЕсли ВариантОтображенияИтогов = Перечисления.ВариантыОтображенияИтоговБанкИКасса.ОстаткиПересчитанныеВВалюту Тогда
		//ТекстНадписи = "Пересчет выполняется по текущему курсу.";
		ТекстНадписи = НСтр("ka='გადაანგარიშება ხდება მიმდინარე კურსით.';ru='Пересчет выполняется по текущему курсу.';en='Recalculation is performed at the current exchange rate.'")
	Иначе
		//ТекстНадписи = "Итоги в панели отображаться не будут.";
		ТекстНадписи = НСтр("ka='შედეგები არ გამოჩნდება პანელზე.';ru='Итоги в панели отображаться не будут.';en='The results will not be displayed in the panel.'")
	КонецЕсли;
	
	Элементы.ДекорацияПояснительнаяНадпись.Заголовок = ТекстНадписи;
	
КонецПроцедуры
